# сюда импортируем

# Вариант 1

# import mobul1  # указываем какой файла импортируем 

# print(mobul1.max1(5, 9))  # указываем импортируемый фаил и функцию  

# # 9

# Вариант 2

# from mobul1 import max1  # напримую оброщаемся к файлу  и указываем фунтцию

# print(max1(5, 9))   #  функцию  

# 9

# Вариант 3

# from mobul1 import *  # напримую оброщаемся к файлу  и ставим (*) чтобы не писать функцию или все функции из того файла

# print(max1(5, 9))     #  функцию  

# 9

# Вариант 4

# import mobul1 as m1    # напримую оброщаемся к файлу  и меняем названия тольео на эту функцыю

# print(m1.max1(5, 9))   #  новое название и функция  

# 9

