# Задача №1
# За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.

# варианат 1
# n = 700
# m = 1450 
# или 
# n = int(input('Сколько машина проедит за день: '))
# m = int(input('какой путь нужно проехать: '))

# result = (n + m - 1) // n 

# print('Понадобиться', result, 'дней')


# вариант 2 

# import math

# n = 700
# m = 750 
# print('Необходимо', math.ceil(m/n), 'дн(-я/-ей)')


