# Задача №7. Решение в группах
# Дано натуральное число. Требуется определить, является ли год с данным номером високосным. Если
# год является високосным, то выведите YES, иначе выведите NO. Напомним, что в соответствии с
# григорианским календарем, год является високосным, если его номер кратен 4, но не кратен
# 100, а также если он кратен 400.

# Input: 2016
# Output: YES

# вывод весакостных годов от 0 до 3000 
# a = int(input('Детка введи год: '))

# r = range(0, 3000, 4)

# for i in r: 
#     print(a)

# проверяем весакостный год или нет 

# year = int(input("В ведите год: "))

# if year % 4 == 0 and year % 100 != 0 or year % 400 == 0: 
#     print(f"Весакостный {year}")
# else:
#     print('Не весакостный')
