# Задача № 17 
# Дан список чисел надо найти сколько в нем встречаются разных чисел

# input:[1, 1, 2, 0, -1, 3, 4, 4]

# Output: 6

# l = [1, 1, 2, 0, -1, 3, 4, 4]

# def how_many_dif_elements(list):
#     list = set(list)
#     print(f'В этот списоке {l} - {len(list)} одинаковые елементов ')

# how_many_dif_elements(l)

# В этот списоке [1, 1, 2, 0, -1, 3, 4, 4] - 6 одинаковые елементов 

###

