# *****(3)Напишите программу, которая принимает на вход две строки и определяет, 
# являются ли они анаграммами. Знаки препинания, пробелы и регистр при этом игнорируются.

# Пример ввода:
# Цари, вино и сало.
# Лисица и ворона.

# Пример вывода:
# YES

# *****(4)Напишите функцию, которая принимает словарь с параметрами и возвращает строку запроса, 
# сформированную из отсортированных в лексикографическом порядке параметров.

# Пример:

# Код print(query({'course': 'python', 'lesson': 2, 'challenge': 17})) должен возвращать строку:

# challenge=17&course=python&lesson=2