# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# *** (1)У вас есть массив чисел, составьте из них максимальное число. Например:
# [61, 228, 9] -> 961228


# n = int(input('Введите число N: '))
# list_1 = [i for i in range(1, n) if i % 2 == 0] 

# print(list_1)

# Ответ: Введите число N: 6
#        [2, 4]