# Как работать со списками?
# list_1 = []  # Создание пустого списка

# list_2 = list()  # Создание пустого списка

# list_1 = [7, 9, 11, 13, 15, 17]
#         0, 1,  2,  3,  4,  5
# print(list_1[0])  # 7

# print(list_1[-1])  # будет показывать последный элемент

# 17

# print(list_1)  #  [7, 9, 11, 13, 15, 17]

# print(*list_1)  # 7 9 11 13 15 17

# for i in list_1:  # буде переберать список
#     print(i)

# 7
# 9
# 11
# 13
# 15
# 17

# print(len(list_1))   # буде показывать сколько элементов

# 6

# # Будем добавлять елементы
# list_1 = [1, 5]
# print(list_1)  # [1, 5]
# list_1.append(8) # Добавляем 8
# print(list_1)  # [1, 5, 8]
# list_1.append(85) # Добавляем 8
# print(list_1)  # [1, 5, 8, 85]

# # Будем добавлять каждый раз по элементу
# list_1 = []  # пустой список
# print(list_1)  # вывод пустова списка
# for i in range(5):  # Прокручиваем  до 5
#     list_1.append(i)  # добавляем на один больше
#     print(list_1)  #

# []
# [0]
# [0, 1]
# [0, 1, 2]
# [0, 1, 2, 3]
# [0, 1, 2, 3, 4]

# Удаление последнего элемента списока.
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.pop())  # 0
# print(list_1)  # [12, 7, -1, 21]
# print(list_1.pop())  # 21
# print(list_1)  # [12, 7, -1]
# print(list_1.pop())  # -1
# print(list_1)  # [12, 7]

# 0
# [12, 7, -1, 21]
# 21
# [12, 7, -1]
# -1
# [12, 7]

# Удаление конкретного элемента списка
# list_1 = [12, 7, -1, 21, 0]
# # print(list_1.pop(0))  # 12
# print(list_1.pop(1))  # 7
# print(list_1)  # [7, -1, 21, 0]

# 12
# [7, -1, 21, 0]

# 7
# [12, -1, 21, 0]

# Добавление элеента на нужную позицию
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.insert(2, 11))  # указываем на какой место ставить элемент, и какой элемент
# print(list_1)  # [12, 7, 11, -1, 21, 0]

# None
# [12, 7, 11, -1, 21, 0]

# Работаем сосписками меняем элементы

# list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(list_1[0])                        # 1
# print(list_1[1])                        # 2
# print(list_1[len(list_1) -1])           # 10
# print(list_1[-5])                       # 6
# print(list_1[:])                        # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(list_1[:2])                       # [1, 2]
# print(list_1[len(list_1)-2:])           # [9, 10]
# print(list_1[2:9])                      # [3, 4, 5, 6, 7, 8, 9]
# print(list_1[6:-18])                    # []
# print(list_1[0:len(list_1):6])          # [1, 7] # идем с шагом 6 
# print(list_1[::6])                      # [1, 7]

# Кортежи - Это не исменяемый список 

# t = ()  # создание пустого кортежа 

# print(type(t))  # class <'tupel'>

# t = (1,)

# print(type(t))

# t = (1, 5, 3,)
# print(type(t))

# v = [1, 8, 9]
# print(v)
# print(type(v))

# v = tuple(v)
# print(v)
# print(type(v))

# a,b,c = v  # они равны v 

# print(a, b, c)  # 1 8 9


# t = (1, 2, 3, 5,)

# for i in t: 
#     print(i)

# 1
# 2
# 3
# 5

# t = [1, 2, 3, 5]

# t[0] = 2 

# print(t)   # [2, 2, 3, 5]


#  работаем со славорями 

# d = {}
# d = dict()

# d['q'] = 'qwerty'
# print(d)

# d['w'] = 'qwerty'
# print(d)

# {'q': 'qwerty'}
# {'q': 'qwerty', 'w': 'qwerty'}


# 

# d = {}
# d = dict()

# d['q'] = 'qwerty'
# print(d)

# d['q'])

# {'q': 'qwerty'}
# qwerty
